Revit 2026 API

# FamilyManagerGetAssociatedFamilyParameter Method

---

Gets the associated family parameter of an element parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyParameter GetAssociatedFamilyParameter(
	Parameter elementParameter
)
```
```vb
Public Function GetAssociatedFamilyParameter (
	elementParameter As Parameter
) As FamilyParameter
```
```cpp
public:
FamilyParameter^ GetAssociatedFamilyParameter(
	Parameter^ elementParameter
)
```
```fsharp
member GetAssociatedFamilyParameter :
        elementParameter : Parameter -> FamilyParameter
```

#### Parameters

elementParameter Parameter
    The parameter of an element in family.

#### Return Value

FamilyParameterThe associated family parameter if there is an association between them, returns  if not.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"elementParameter"-is . |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace